{
  "company": "Pharmako Biotechnologies",
  "articles": [
    {
      "headline": "Pharmako Biotechnologies celebrates 10 years of scientifically validated delivery systems",
      "date": "21/05/2025",
      "summary": "Pharmako Biotechnologies marked its 10th anniversary, highlighting multi-award-winning technologies like AquaCelle, LipiSperse, CPO, and PlexoZome, with over 30 clinical trials, 20+ published papers, expansion of product portfolio, and partnerships including Gencor Pacific.",
      "growth_type": "Anniversary milestone, awards, product expansion, partnerships, clinical trials",
      "source_url": "https://nutraceuticalbusinessreview.com/pharmako-biotechnologies-celebrates-10-years-of-scientifically-validated"
    },
    {
      "headline": "Pharmako Biotechnologies: Clinically Proven, Award Winning Advanced Delivery Systems",
      "date": "01/01/2025",
      "summary": "Pharmako celebrates 10 years of innovation with clinically proven, multi award-winning delivery systems, 4 patented/patent pending technologies commercialized globally, products sold in over 18 countries, and 5 in-house laboratories.",
      "growth_type": "Awards, patents, expansion, milestones",
      "source_url": "https://www.pharmako.com.au"
    },
    {
      "headline": "Pharmako Biotechnologies outlines clinical trial plans and new collaborations following TGA site approval",
      "date": "17/03/2021",
      "summary": "Pharmako Biotechnologies received TGA approval as the first licensed manufacturer in Australia for producing Active Pharmaceutical Ingredients with advanced dispersion and solubility technologies, enabling clinical trials on new microbiome products and studies on menstrual pain, neuropathy, and infections. They collaborate with global companies like Walgreens and Schiff.",
      "growth_type": "Regulatory approval, clinical trials, partnerships",
      "source_url": "https://www.nutraingredients.com/Article/2021/03/17/Pharmako-Biotechnologies-outlines-clinical-trial-plans-and-new-collaborations-following-TGA-site-approval/"
    }
  ]
}